{"meta":{"title":"Smilelife","subtitle":"若不坚强，谁替我勇敢","description":null,"author":"关小涛","url":"http://www,xtslift.top"},"pages":[],"posts":[{"title":"穷查理宝典","slug":"穷查理宝典","date":"2019-04-26T08:11:01.000Z","updated":"2019-04-26T08:45:28.594Z","comments":false,"path":"2019/04/26/穷查理宝典/","link":"","permalink":"http://www,xtslift.top/2019/04/26/穷查理宝典/","excerpt":"","text":"​ 查理·芒格（Charlie Thomas Munger，1924年1月1日—）美国投资家，沃伦·巴菲特的黄金搭档，伯克夏·哈撒韦公司的副主席。 ​ 查理·芒格(Charlie Thomas Munger)，出生于美国内布拉斯加州的奥马哈。这位今年已经95岁高寿的老人，在过去的46年里，他和巴菲特联手创造了有史以来最优秀的投资纪录——伯克希尔公司股票账面价值以年均20.3%的复合收益率创造投资神话，每股股票价格从19美元升至84487美元。 你将获得 什么样的成长经历造就了芒格的巨大成功？ 什么是芒格极力推崇的反向思维？ 如何培养自己的跨学科思维？ 什么是“耐心等待的艺术”？ 书中金句 我这辈子遇到的聪明人没有不每天阅读的——没有，一个都没有。沃伦读书之多，我读书之多，可能会让你感到吃惊。 在手里拿着铁锤的人看来, 世界就像一颗钉子，这是处理问题的一种笨办法。 很小的时候我就明白了这样一个道理：要得到你想要的某样东西，最可靠的办法是让你自己配得上它。 生活之所以如此，是为了让你们能够处理错误。 我之所以能有今天，靠的就是不去追逐平庸的机会。 说真话，你将无须记住你的谎言。 说出一个谎言，就得用无数个谎言去掩盖它。所以，诚实是最好的策略。 精华笔记这本书的作者是谁？​ 作者查理·芒格，是巴菲特的黄金搭档，有“幕后智囊”和“最后的秘密武器”之称，这是一本传记式的名人札记，介绍了主人公查理·芒格的生平和主要思想。 查理·芒格是一个什么样的人？关键词一：家庭芒格出生在大萧条时期，在亲友的相互帮扶下，芒格一家度过了那段艰苦的时光，这段经历让芒格早早地体会到亲情的可贵，他和妻子南希共同抚养8个子女，始终生活在一所老房子里。 关键词二：阅读查理·芒格几乎在任何时候都会随身携带一本书，他说“我手里只要有一本书，就不会觉得浪费时间”。 关键词三：坚韧无论在顺境还是逆境，芒格都喜欢积极地寻找解决办法。一次交通意外让他右眼丧失了90%的视力，但他既不消极放弃，也不怨天尤人，最后奇迹地恢复了视力。 关键词四：睿智和当时绝大多数人不同，芒格对于投资有自己独特的想法，他甚至还发明了一套“人类误判心理学”用来纠正自己的投资观念。 关键词五：搭档巴菲特曾这样形容芒格带给他的帮助：“查理拓展了我的视野。让我以非同寻常的速度从猩猩进化到人类，没有查理，我会比现在贫穷得多”。 关键词六：仁慈热衷于慈善事业，不仅亲自担任几个慈善机构的理事，还为斯坦福大学捐赠了6000千万美元的公益基金。 什么是芒格极力推崇的反向思维？在很多公开场合，芒格本人都表示过，他成功根本原因在于始终坚持用一套方法去处理事情，第一点就是反向思维。 反向思维的含义是说，只要避免让糟糕的决策和糟糕的结果发生，那些美好的事物自然会随之而来，所以在思考问题时，芒格总是从反向开始。 查理·芒格持续不断地收集关于各种人物、企业以及政府管理领域里著名的失败案例，并把这些失败成因写在纸上，每次在做重要的决策前，都会拿出来看一下。 案例：哈佛大学演讲、预测美国金融危机 什么是能力圈？“能力圈”就是指一个人的能力边界，超出能力范围以外的事绝对不要做。如果你无法称职地回答出下一个问题，那就意味着你已经在能力圈之外了，能力圈就是我们的护城河，一旦越界，后果会很危险。 巴菲特说，他们真正的本领是能够弄清楚，自己什么时候在能力圈中心运作，什么时候正在向边缘靠近。 案例：普朗克和他的司机 如何培养自己的跨学科思维？在查理·芒格的眼中，真实的世界里最重要的事情不是分类，而是解决问题，不管是哪个学科的方法，只要有助于解决这个问题，都可以拿来借鉴。 现实生活中，大多数人都试图用一种思维模型来解决所有问题，在手里拿着一把锤子的人眼中，世界只有钉子。想要洞察问题的本质，我们必须要培养自己这种跨学科思考的方式。 方法一是把物理、数学、化学等硬科学，还有心理学、经济学等软科学里的经典概念提炼出来，作为自己的思维模型。 方法二是向不同领域里最顶尖的人才学习。 什么是“耐心等待的艺术”？不要在恰当的时机没来之前就沉不住气，挥棒次数太过频繁的结果，可能就是真正好球来的时候，没有办法全力出击。 案例：棒球手泰勒的挥球技巧、巴菲特的打卡纸 有两个训练方法可以帮助我们强化判断能力，第一个方法叫双轨分析法，第二个方法叫飞行模拟法。 双规分析法：我们一般人在决策的时候，往往要么只从感性角度考虑，要么只从理性角度考虑，很少有人从两方面同时考量一个问题。双轨分析法就是在提醒大家，任何一个问题，都可能比你想象的更复杂。 飞行模拟法：把模拟器上的问题当成真实问题来解决，最好的模拟器是“案例”。","categories":[{"name":"文艺","slug":"literature","permalink":"http://www,xtslift.top/categories/literature/"}],"tags":[{"name":"查理·芒格","slug":"查理·芒格","permalink":"http://www,xtslift.top/tags/查理·芒格/"},{"name":"投资","slug":"投资","permalink":"http://www,xtslift.top/tags/投资/"},{"name":"理财","slug":"理财","permalink":"http://www,xtslift.top/tags/理财/"},{"name":"习惯","slug":"习惯","permalink":"http://www,xtslift.top/tags/习惯/"}],"keywords":[{"name":"文艺","slug":"literature","permalink":"http://www,xtslift.top/categories/literature/"}]},{"title":"My first blog","slug":"My-first-blog","date":"2019-04-26T05:37:02.000Z","updated":"2019-04-26T08:30:19.558Z","comments":false,"path":"2019/04/26/My-first-blog/","link":"","permalink":"http://www,xtslift.top/2019/04/26/My-first-blog/","excerpt":"","text":"​ 近几天花了些时间来做自己的博客，做完了表结构的设计然后又点迷茫不知所措。最后竟然以偷懒的方式先实现了自己的小目标。虽然不是自己完整设计编码的，但还是很开心。本博客借助hexo框架和github来实现的，是入门级的入门级。估计随便来个小白，看看文档也就成了。不过这并不影响，再也不用去担心，电脑上乱七八糟的文档，想要写点自己的东西又很不方便情况。在我的博客，我说了算。 关于自己​ 今天听书的时候听到这样的一句话，很小的时候我就明白了一个道理：要得到你想要的某样东西，最可靠的办法就是让你自己配的上它。生活之所以如此，是为了让你们能够处理错误。是的没错，想要得到某样东西，是要让自己配的上它。当自己的野心得不到满足的时候，我们只能低下头来使自己成长强大，来配的上自己的野心。 关于博客​ 博客要写些什么呢？在今后的日子里我的博客会用来整理和复习编程知识以及新技术学习的总结，将会把他们放在编程类里面。工具里面会放一些工具的相关资源和使用教程，生活会用来记录对自己有意义的事情比如旅游比如纪念日；文艺呢？当然是诗书这样的了呢。文笔这东西，还是的写。近来书看的少了，笔动的少了，想写点东西，半天憋不出一句实属难受。 最后​ 我若不坚强，谁替我勇敢。加油就完事了，我不相信，我也不可能相信我的生活仅仅是现在的样子。","categories":[{"name":"编程","slug":"programming","permalink":"http://www,xtslift.top/categories/programming/"}],"tags":[{"name":"java","slug":"java","permalink":"http://www,xtslift.top/tags/java/"},{"name":"web","slug":"web","permalink":"http://www,xtslift.top/tags/web/"},{"name":"blog","slug":"blog","permalink":"http://www,xtslift.top/tags/blog/"}],"keywords":[{"name":"编程","slug":"programming","permalink":"http://www,xtslift.top/categories/programming/"}]}]}