{"meta":{"title":"Smilelife","subtitle":"若不坚强，谁替我勇敢","description":null,"author":"关小涛","url":"http://www,xtslift.top"},"pages":[],"posts":[{"title":"断舍离","slug":"断舍离","date":"2019-04-27T13:09:52.000Z","updated":"2019-04-27T13:26:43.438Z","comments":true,"path":"2019/04/27/断舍离/","link":"","permalink":"http://www,xtslift.top/2019/04/27/断舍离/","excerpt":"","text":"01思考 第一，断舍离是什么，它能给人带来怎样的变化？ 第二，我们为什么会舍不得扔东西？ 第三，如何断舍离？ 02 书中金句 断舍离是维持生活状态的工作，也是自我探索的工具。试着使用高于自我形象的物品。使用精挑细选的自己喜爱的东西，这样就能够挖掘出全新的自己，也就是说，物品并不只是用来使用的，而是要进入更高的阶段，最大限度地利用物品的力量。 拥有就是深信不疑的错觉，理解了拥有本质，就能自然地涌出珍惜物品的心情。 在面对一大堆物品，不知道该怎么分类，毫无头绪的时候，可以按照三分法。必需品，备用品和没用品进行分类，如果已经淘汰了，没用的物品，这个时候就只剩下。必需品和备用物品。 03 精华笔记一般的整理收纳术把焦点放到物品上，更重视方法和工具。比如家里有多少物品都没关系，只要用盒子装起来就可以；再比如，有多少物品都要想办法展示出来；而断舍离则以人为主，帮助我们探索：自己想成为什么样的人，要过什么样的生活，最终真正喜欢上自己。 断舍离是什么？ 想记住断舍离的概念，一个公式就足够。断＝断绝不需要的东西，减少不必要的购买，舍＝舍弃多余的废物，从现有物品中做减法，离＝脱离对物品的执着。断+舍=离。但是，是不是少买东西，不敢轻易买东西就是做到断了呢？多淘汰旧物品就是做到舍了呢？其实，断舍离并不是倡导人们去过朴素、贫乏的生活，它还包含了一层重要的意义：升级。 所谓升级，是重新思考你和物品的关系，站在更高水准，使用高于自我形象的物品。当你使用精挑细选的，非常喜爱的东西时，能够挖掘出全新的自己。也就是说，物品并不只是拿来用的，要最大限度地利用物品的力量。 不断舍离会怎样？ 首先，没有收拾的屋子就像便秘，会产生心情废气。在便秘的时候，病菌会不断释放毒素，这些毒素会被肠道再次吸收，而后扩散到身体各个部位，引起不适。换句话说，房间里满是破烂，就会释放出影响心情的废气，让你不知不觉间陷入慢性中毒。 第二，环境中会产生灰尘垃圾，因为到处都是不喜欢的东西，你根本不愿意擦拭和保养，时间长了肯定会覆盖很多灰尘、霉菌、螨虫； 第三，影响你的运气。因为杂物堵塞了运势，旧的不去，新的不来，原本可能会有好运接近你，可能被杂乱挡在门外。当然，这样的说法可能接近与中国的风水学说了，但是有一点我们可以肯定：人生的种种苦恼，往往混杂在对物品的执着中。 实践了断舍离之后，会对人生带来什么改变呢？ 首先，时间变充裕了，减少杂物之后，人能够生活在舒适、有序的环境中，日常维护物品的压力自然减轻，家务活变得简单轻松。可以做更多自己喜欢的事情，比如高质量的陪伴家人。 其次，可以提升你的内在能量，在好的空间里，人与环境相处变得更加和谐，从情绪上远离负面能量，多了正向力量，能感觉到内心的平静、愉快、自在。做事效率更高，更加从容，甚至可以激发更多创作的灵感。 最后，通过限制物品总量，学会更加严格地筛选出自己喜欢的会真正使用的物品，自然提升了品位。 我们为什么舍不得扔东西？作者提出，有三类人会舍不得丢弃物品。 第一类，他们可能是逃避现实的人。因为怕麻烦，不想面对烦心事，但是今天轻松图省事的人，将来都会绊倒在往日的不作为上。 第二类，他们可能是执着过去的人。这是另一种形式的逃避现实。因为每件物品都携带情感和回忆，物品等于复杂的个人历史。过去太美好，不愿意舍弃；过去很灰暗，舍弃的时候会痛苦，也会重新提醒自己曾经的失败。 最后一类是担忧未来的人。这些人的内心没有安全感。淘汰了物品，结果后来要用的时候找不到，所以总是担心。最后一类人群比例的最高的。当然，不是所有人都只属于某一类型，很可能有人是三合一。 那么，作者倡导我们丢掉什么东西呢？ ​ 第一类是不用的东西，总想着有一天要物尽其用，但压根这一天不会来到。第二类是还在用，但不适合自己的 东西，往往只是随便用用，但并不喜欢。第三类是充满回忆的东西，它们身上承载了强大的能量和气场。 如何在生活中实践断舍离呢？第一，任何时候，都以我为主，以我为中心做决定。 要过上以人为主导，而不是以物品为主导的人生。也就是在看待事物的时候，要以我和事物的关系为出发点。 必须只考虑当下的我。 第二，要学会宽恕自己，宽恕他人。人人都有一种言行一致的愿望。我们买回了物品，但没有使用，这等于背弃了当时购买时的承诺，所以很容易产生愧疚感，甚至产生挫败感，不再相信自己的决策力，习惯性的自我否定。这时候要告诉自己，迟迟不处理堆积的杂物，还要经常看到它们，这等于对自己持续不断的负面评判和内心惩罚。 第三，突破“不配得”心理，不将就。什么是“不配得”心理呢？如果平时已经习惯了生活在不喜欢、不需要的事物中，也就是经常处在“将就、凑合”的状态，那么你就是在潜意识里告诉自己“我配不上更好的”。 断舍离的实用行动方法 第一，筛选物品时，标准尽可能简单，舍弃物品时要有仪式感。 第二，个性化安排整理时间，根据能利用的时间段安排整理行动。 第三，收纳时可以参考7、5、1原则和三自原则。 最后，一个动作可以拿到物品。","categories":[{"name":"文艺","slug":"literature","permalink":"http://www,xtslift.top/categories/literature/"}],"tags":[{"name":"整理","slug":"整理","permalink":"http://www,xtslift.top/tags/整理/"},{"name":"舍弃","slug":"舍弃","permalink":"http://www,xtslift.top/tags/舍弃/"},{"name":"心态","slug":"心态","permalink":"http://www,xtslift.top/tags/心态/"}],"keywords":[{"name":"文艺","slug":"literature","permalink":"http://www,xtslift.top/categories/literature/"}]},{"title":"穷查理宝典","slug":"穷查理宝典","date":"2019-04-26T08:11:01.000Z","updated":"2019-04-26T08:45:28.594Z","comments":false,"path":"2019/04/26/穷查理宝典/","link":"","permalink":"http://www,xtslift.top/2019/04/26/穷查理宝典/","excerpt":"","text":"​ 查理·芒格（Charlie Thomas Munger，1924年1月1日—）美国投资家，沃伦·巴菲特的黄金搭档，伯克夏·哈撒韦公司的副主席。 ​ 查理·芒格(Charlie Thomas Munger)，出生于美国内布拉斯加州的奥马哈。这位今年已经95岁高寿的老人，在过去的46年里，他和巴菲特联手创造了有史以来最优秀的投资纪录——伯克希尔公司股票账面价值以年均20.3%的复合收益率创造投资神话，每股股票价格从19美元升至84487美元。 你将获得 什么样的成长经历造就了芒格的巨大成功？ 什么是芒格极力推崇的反向思维？ 如何培养自己的跨学科思维？ 什么是“耐心等待的艺术”？ 书中金句 我这辈子遇到的聪明人没有不每天阅读的——没有，一个都没有。沃伦读书之多，我读书之多，可能会让你感到吃惊。 在手里拿着铁锤的人看来, 世界就像一颗钉子，这是处理问题的一种笨办法。 很小的时候我就明白了这样一个道理：要得到你想要的某样东西，最可靠的办法是让你自己配得上它。 生活之所以如此，是为了让你们能够处理错误。 我之所以能有今天，靠的就是不去追逐平庸的机会。 说真话，你将无须记住你的谎言。 说出一个谎言，就得用无数个谎言去掩盖它。所以，诚实是最好的策略。 精华笔记这本书的作者是谁？​ 作者查理·芒格，是巴菲特的黄金搭档，有“幕后智囊”和“最后的秘密武器”之称，这是一本传记式的名人札记，介绍了主人公查理·芒格的生平和主要思想。 查理·芒格是一个什么样的人？关键词一：家庭芒格出生在大萧条时期，在亲友的相互帮扶下，芒格一家度过了那段艰苦的时光，这段经历让芒格早早地体会到亲情的可贵，他和妻子南希共同抚养8个子女，始终生活在一所老房子里。 关键词二：阅读查理·芒格几乎在任何时候都会随身携带一本书，他说“我手里只要有一本书，就不会觉得浪费时间”。 关键词三：坚韧无论在顺境还是逆境，芒格都喜欢积极地寻找解决办法。一次交通意外让他右眼丧失了90%的视力，但他既不消极放弃，也不怨天尤人，最后奇迹地恢复了视力。 关键词四：睿智和当时绝大多数人不同，芒格对于投资有自己独特的想法，他甚至还发明了一套“人类误判心理学”用来纠正自己的投资观念。 关键词五：搭档巴菲特曾这样形容芒格带给他的帮助：“查理拓展了我的视野。让我以非同寻常的速度从猩猩进化到人类，没有查理，我会比现在贫穷得多”。 关键词六：仁慈热衷于慈善事业，不仅亲自担任几个慈善机构的理事，还为斯坦福大学捐赠了6000千万美元的公益基金。 什么是芒格极力推崇的反向思维？在很多公开场合，芒格本人都表示过，他成功根本原因在于始终坚持用一套方法去处理事情，第一点就是反向思维。 反向思维的含义是说，只要避免让糟糕的决策和糟糕的结果发生，那些美好的事物自然会随之而来，所以在思考问题时，芒格总是从反向开始。 查理·芒格持续不断地收集关于各种人物、企业以及政府管理领域里著名的失败案例，并把这些失败成因写在纸上，每次在做重要的决策前，都会拿出来看一下。 案例：哈佛大学演讲、预测美国金融危机 什么是能力圈？“能力圈”就是指一个人的能力边界，超出能力范围以外的事绝对不要做。如果你无法称职地回答出下一个问题，那就意味着你已经在能力圈之外了，能力圈就是我们的护城河，一旦越界，后果会很危险。 巴菲特说，他们真正的本领是能够弄清楚，自己什么时候在能力圈中心运作，什么时候正在向边缘靠近。 案例：普朗克和他的司机 如何培养自己的跨学科思维？在查理·芒格的眼中，真实的世界里最重要的事情不是分类，而是解决问题，不管是哪个学科的方法，只要有助于解决这个问题，都可以拿来借鉴。 现实生活中，大多数人都试图用一种思维模型来解决所有问题，在手里拿着一把锤子的人眼中，世界只有钉子。想要洞察问题的本质，我们必须要培养自己这种跨学科思考的方式。 方法一是把物理、数学、化学等硬科学，还有心理学、经济学等软科学里的经典概念提炼出来，作为自己的思维模型。 方法二是向不同领域里最顶尖的人才学习。 什么是“耐心等待的艺术”？不要在恰当的时机没来之前就沉不住气，挥棒次数太过频繁的结果，可能就是真正好球来的时候，没有办法全力出击。 案例：棒球手泰勒的挥球技巧、巴菲特的打卡纸 有两个训练方法可以帮助我们强化判断能力，第一个方法叫双轨分析法，第二个方法叫飞行模拟法。 双规分析法：我们一般人在决策的时候，往往要么只从感性角度考虑，要么只从理性角度考虑，很少有人从两方面同时考量一个问题。双轨分析法就是在提醒大家，任何一个问题，都可能比你想象的更复杂。 飞行模拟法：把模拟器上的问题当成真实问题来解决，最好的模拟器是“案例”。","categories":[{"name":"文艺","slug":"literature","permalink":"http://www,xtslift.top/categories/literature/"}],"tags":[{"name":"查理·芒格","slug":"查理·芒格","permalink":"http://www,xtslift.top/tags/查理·芒格/"},{"name":"投资","slug":"投资","permalink":"http://www,xtslift.top/tags/投资/"},{"name":"理财","slug":"理财","permalink":"http://www,xtslift.top/tags/理财/"},{"name":"习惯","slug":"习惯","permalink":"http://www,xtslift.top/tags/习惯/"}],"keywords":[{"name":"文艺","slug":"literature","permalink":"http://www,xtslift.top/categories/literature/"}]},{"title":"My first blog","slug":"My-first-blog","date":"2019-04-26T05:37:02.000Z","updated":"2019-04-26T08:30:19.558Z","comments":false,"path":"2019/04/26/My-first-blog/","link":"","permalink":"http://www,xtslift.top/2019/04/26/My-first-blog/","excerpt":"","text":"​ 近几天花了些时间来做自己的博客，做完了表结构的设计然后又点迷茫不知所措。最后竟然以偷懒的方式先实现了自己的小目标。虽然不是自己完整设计编码的，但还是很开心。本博客借助hexo框架和github来实现的，是入门级的入门级。估计随便来个小白，看看文档也就成了。不过这并不影响，再也不用去担心，电脑上乱七八糟的文档，想要写点自己的东西又很不方便情况。在我的博客，我说了算。 关于自己​ 今天听书的时候听到这样的一句话，很小的时候我就明白了一个道理：要得到你想要的某样东西，最可靠的办法就是让你自己配的上它。生活之所以如此，是为了让你们能够处理错误。是的没错，想要得到某样东西，是要让自己配的上它。当自己的野心得不到满足的时候，我们只能低下头来使自己成长强大，来配的上自己的野心。 关于博客​ 博客要写些什么呢？在今后的日子里我的博客会用来整理和复习编程知识以及新技术学习的总结，将会把他们放在编程类里面。工具里面会放一些工具的相关资源和使用教程，生活会用来记录对自己有意义的事情比如旅游比如纪念日；文艺呢？当然是诗书这样的了呢。文笔这东西，还是的写。近来书看的少了，笔动的少了，想写点东西，半天憋不出一句实属难受。 最后​ 我若不坚强，谁替我勇敢。加油就完事了，我不相信，我也不可能相信我的生活仅仅是现在的样子。","categories":[{"name":"编程","slug":"programming","permalink":"http://www,xtslift.top/categories/programming/"}],"tags":[{"name":"java","slug":"java","permalink":"http://www,xtslift.top/tags/java/"},{"name":"web","slug":"web","permalink":"http://www,xtslift.top/tags/web/"},{"name":"blog","slug":"blog","permalink":"http://www,xtslift.top/tags/blog/"}],"keywords":[{"name":"编程","slug":"programming","permalink":"http://www,xtslift.top/categories/programming/"}]}]}